package OOP;

public class Lection1 {
    // Абстракция - что делает сущность?
    // Представитель (или экземпляр) - Как делает?
    // Спецка - набор правил, описывающих API
    // Состояние - набор данных (полей, атрибутов, членов класса)
    // Поведение - функции для работы с данными и выполнения полезной работы
/*
    Состояние               Поведение
    * поля                  * конструкторы
    * константы             * методы
    * события*/
    //Конструктор по умолчанию - конструктор без аргументов
    //Можно создать несколько конструкторов одного класса, и исполь
    //зовать их по мере необходимости.
    //private = только внутри описываемого класса доступен
    //public = доступен из любого места программы
    // переопределение - меняем то, что делали до нас - оверрайд
    // перегрузка описываем методы, отличающиеся сигнатурой
    // сигнатура - инт, инт, инт, инт, возвр дабл,
    // нельзя сделать перегрузку по имени аргументов.
    // принцип драй не очень поняла про this.
    // /** нет автодописи. Как сделать?
    // для статиков - через имя типа.
    // Инкапсуляция - в капсулу. Видим только кнопку, не видим шестеренки



}
